In [2]:
import pandas as pd
import numpy as np

In [ ]:
Pandas: Data frame and Series data structure

In [50]:
movie={

"movie_title" : ["Avatar", "Pirates of the Caribbean", "Spectre", "The Dark Knight Rises", "Star Wars VII", "John Carter"],

"director_name": ["James Cameron","Gore Verbinski",np.nan , "Christopher Nolan", "Doug Walker",np.nan],

"imdb_score": [7.9,7.1,6.8,8.5,7.1,6.6]
}
# np.nan means it is missing values, as blank space '' means no director.

In [51]:
df=pd.DataFrame(movie)

In [52]:
df

                movie_title      director_name  imdb_score
0                    Avatar      James Cameron         7.9
1  Pirates of the Caribbean     Gore Verbinski         7.1
2                   Spectre                NaN         6.8
3     The Dark Knight Rises  Christopher Nolan         8.5
4             Star Wars VII        Doug Walker         7.1
5               John Carter                NaN         6.6

In [6]:
df.columns

Index(['movie_title', 'director_name', 'imdb_score'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
df.values

array([['Avatar', 'James Cameron', 7.9],
       ['Pirates of the Caribbean', 'Gore Verbinski', 7.1],
       ['Spectre', nan, 6.8],
       ['The Dark Knight Rises', 'Christopher Nolan', 8.5],
       ['Star Wars VII', 'Doug Walker', 7.1],
       ['John Carter', nan, 6.6]], dtype=object)

# Data Types

In [10]:
df.dtypes

movie_title       object
director_name     object
imdb_score       float64
dtype: object

# Series and its methods

In [12]:
director=df['director_name']

In [13]:
director.head()

0        James Cameron
1       Gore Verbinski
2                  NaN
3    Christopher Nolan
4          Doug Walker
Name: director_name, dtype: object

In [15]:
director.value_counts()

Christopher Nolan    1
James Cameron        1
Doug Walker          1
Gore Verbinski       1
Name: director_name, dtype: int64

In [18]:
movie={

"movie_title" : ["Avatar", "Pirates of the Caribbean", "Spectre", "The Dark Knight Rises", "Star Wars VII", "John Carter"],

"director_name": ["James Cameron","Gore Verbinski",np.nan , "James Cameron", "Doug Walker",np.nan],

"imdb_score": [7.9,7.1,6.8,8.5,7.1,6.6]
}

In [17]:
df1=pd.DataFrame(movie)

In [20]:
director1=df1.director_name

In [22]:
director1.value_counts()

James Cameron     2
Gore Verbinski    1
Doug Walker       1
Name: director_name, dtype: int64

In [23]:
director.size

6

In [24]:
director.shape

(6,)

In [25]:
score=df['imdb_score']

In [26]:
score.max()

8.5

In [27]:
score.describe()

count    6.000000
mean     7.333333
std      0.722957
min      6.600000
25%      6.875000
50%      7.100000
75%      7.700000
max      8.500000
Name: imdb_score, dtype: float64

In [28]:
director_filled=director.fillna(0)

In [29]:
director_filled

0        James Cameron
1       Gore Verbinski
2                    0
3    Christopher Nolan
4          Doug Walker
5                    0
Name: director_name, dtype: object

In [30]:
director_drop=director.dropna()

In [31]:
director_drop

0        James Cameron
1       Gore Verbinski
3    Christopher Nolan
4          Doug Walker
Name: director_name, dtype: object

In [32]:
director1.value_counts(normalize=True)

James Cameron     0.50
Gore Verbinski    0.25
Doug Walker       0.25
Name: director_name, dtype: float64

# Operators on Series

In [34]:
score+2

0     9.9
1     9.1
2     8.8
3    10.5
4     9.1
5     8.6
Name: imdb_score, dtype: float64

In [35]:
score

0    7.9
1    7.1
2    6.8
3    8.5
4    7.1
5    6.6
Name: imdb_score, dtype: float64

In [36]:
score*3

0    23.7
1    21.3
2    20.4
3    25.5
4    21.3
5    19.8
Name: imdb_score, dtype: float64

# Chaining on Series

In [38]:
director.isnull().sum()

2

In [39]:
director.isnull().mean()

0.3333333333333333

# Making index Meaningfull

In [40]:
movie2=df.set_index('movie_title')

In [41]:
movie2

                              director_name  imdb_score
movie_title
Avatar                        James Cameron         7.9
Pirates of the Caribbean     Gore Verbinski         7.1
Spectre                                 NaN         6.8
The Dark Knight Rises     Christopher Nolan         8.5
Star Wars VII                   Doug Walker         7.1
John Carter                             NaN         6.6

In [42]:
movie2.reset_index()

                movie_title      director_name  imdb_score
0                    Avatar      James Cameron         7.9
1  Pirates of the Caribbean     Gore Verbinski         7.1
2                   Spectre                NaN         6.8
3     The Dark Knight Rises  Christopher Nolan         8.5
4             Star Wars VII        Doug Walker         7.1
5               John Carter                NaN         6.6

# Rename Rows and Columns

In [55]:
df

                movie_title      director_name  imdb_score
0                    Avatar      James Cameron         7.9
1  Pirates of the Caribbean     Gore Verbinski         7.1
2                   Spectre                NaN         6.8
3     The Dark Knight Rises  Christopher Nolan         8.5
4             Star Wars VII        Doug Walker         7.1
5               John Carter                NaN         6.6

In [69]:
df2=df.set_index('movie_title')# we must first of all set index

In [75]:
idx2={"Avatar": "Godfather", 
      "Spectre":"12 Angry Men"}
col2={'director_name':"Diretor Name",
      'imdb_score': 'score'}

In [76]:
df2.rename(index=idx2, columns=col2)

                               Diretor Name  score
movie_title
Godfather                     James Cameron    7.9
Pirates of the Caribbean     Gore Verbinski    7.1
12 Angry Men                            NaN    6.8
The Dark Knight Rises     Christopher Nolan    8.5
Star Wars VII                   Doug Walker    7.1
John Carter                             NaN    6.6

In [77]:
df2

                               Diretor Name  score
movie_title
Godfather                     James Cameron    7.9
Pirates of the Caribbean     Gore Verbinski    7.1
12 Angry Men                            NaN    6.8
The Dark Knight Rises     Christopher Nolan    8.5
Star Wars VII                   Doug Walker    7.1
John Carter                             NaN    6.6

# Creating and deleting Columns

In [78]:
df['new_col']=0

In [79]:
df

                movie_title      director_name  imdb_score  new_col
0                    Avatar      James Cameron         7.9        0
1  Pirates of the Caribbean     Gore Verbinski         7.1        0
2                   Spectre                NaN         6.8        0
3     The Dark Knight Rises  Christopher Nolan         8.5        0
4             Star Wars VII        Doug Walker         7.1        0
5               John Carter                NaN         6.6        0

In [81]:
df['double_score']=score*2

In [82]:
df

,movie_title,director_name,imdb_score,new_col,double_score
0,Avatar,James Cameron,7.9,0,15.8
1,Pirates of the Caribbean,Gore Verbinski,7.1,0,14.2
2,Spectre,NaN,6.8,0,13.6
3,The Dark Knight Rises,Christopher Nolan,8.5,0,17.0
4,Star Wars VII,Doug Walker,7.1,0,14.2
5,John Carter,NaN,6.6,0,13.2

In [83]:
df['new_col2']=score>6.8

In [84]:
df

,movie_title,director_name,imdb_score,new_col,double_score,new_col2
0,Avatar,James Cameron,7.9,0,15.8,True
1,Pirates of the Caribbean,Gore Verbinski,7.1,0,14.2,True
2,Spectre,NaN,6.8,0,13.6,False
3,The Dark Knight Rises,Christopher Nolan,8.5,0,17.0,True
4,Star Wars VII,Doug Walker,7.1,0,14.2,True
5,John Carter,NaN,6.6,0,13.2,False

In [85]:
del df['new_col2']

In [86]:
df

,movie_title,director_name,imdb_score,new_col,double_score
0,Avatar,James Cameron,7.9,0,15.8
1,Pirates of the Caribbean,Gore Verbinski,7.1,0,14.2
2,Spectre,NaN,6.8,0,13.6
3,The Dark Knight Rises,Christopher Nolan,8.5,0,17.0
4,Star Wars VII,Doug Walker,7.1,0,14.2
5,John Carter,NaN,6.6,0,13.2